{"extraHead":"<meta name='robots' content='noindex,follow' \/>\n<link rel=\"alternate\" type=\"application\/rss+xml\" title=\"ustwo &raquo; Blog Comments Feed\" href=\"http:\/\/ustwo.localhost\/blog\/feed\/\" \/>\n<link rel=\"EditURI\" type=\"application\/rsd+xml\" title=\"RSD\" href=\"http:\/\/ustwo.localhost\/xmlrpc.php?rsd\" \/>\n<link rel=\"wlwmanifest\" type=\"application\/wlwmanifest+xml\" href=\"http:\/\/ustwo.localhost\/wp-includes\/wlwmanifest.xml\" \/> \n<link rel='prev' title='home' href='http:\/\/ustwo.localhost\/' \/>\n<link rel='next' title='Join Us2' href='http:\/\/ustwo.localhost\/join-us2\/' \/>\n<link rel='canonical' href='http:\/\/ustwo.localhost\/blog\/' \/>\n<link rel='shortlink' href='http:\/\/ustwo.localhost\/?p=5840' \/>\n\t<style type=\"text\/css\">.recentcomments a{display:inline !important;padding:0 !important;margin:0 !important;}<\/style>\n","urls":{"site":"http:\/\/ustwo.localhost","page":"\/blog\/","full":"http:\/\/ustwo.localhost\/blog\/","theme":"http:\/\/ustwo.localhost\/wp-content\/themes\/ustwo.com-wp","ajax":"http:\/\/ustwo.localhost\/wp-content\/themes\/ustwo.com-wp\/ajax","css":"http:\/\/ustwo.localhost\/wp-content\/themes\/ustwo.com-wp\/css","js":"http:\/\/ustwo.localhost\/wp-content\/themes\/ustwo.com-wp\/js","images":"http:\/\/ustwo.localhost\/wp-content\/themes\/ustwo.com-wp\/images"},"category":"all","posts":{"items":[{"id":5914,"title":"LateRooms.com - from sketch to MVP","excerpt":"We’ve been working with LateRooms.com to redesign and bring its apps up to current trends and technologies. With a completely blank slate to start with and a client who had faith in the agile process we were raring to go.","content":"<p>Over the last few months ustwo has been <a href=\"http:\/\/www.digitalartsonline.co.uk\/news\/mobile-creativity\/ustwo-designs-new-lateroomscom-app\/\">working<\/a> with <a href=\"http:\/\/www.laterooms.com\/\">LateRooms.com <\/a>to redesign and bring its apps up to current trends and technologies. With a completely blank slate to start with and a client who had faith in the agile process we were raring to go.<\/p>\n<p>Our aim was to completely redesign both the <a href=\"https:\/\/itunes.apple.com\/gb\/app\/laterooms.com-hotel-booking\/id334701579?mt=8\">iOS<\/a> and <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.laterooms\">Android<\/a> versions of the app as a breakthrough proposition for LateRooms.com to transform the booking experience for its users, giving them a quick and secure way to search and book rooms from a choice millions worldwide.<\/p>\n<p>The brief was to develop a functional yet playful app experience that was designed to embrace the distinct ways in which a user searches for accommodation.<\/p>\n<p>To achieve this, we ran a number of activities, including a series of workshops with LateRooms.com to understand the various user journeys and their drivers, how the brand could work effectively within the mobile space and to develop quick prototypes that explored these differences, such as map and time centric user journeys.<\/p>\n<p><div id=\"attachment_5937\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Workshop_capture.png\"><img class=\"size-large wp-image-5937\" alt=\"ustwo and LateRooms.com workshop\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Workshop_capture-1024x749.png\" width=\"1024\" height=\"749\" \/><\/a><p class=\"wp-caption-text\">ustwo and LateRooms.com workshop<\/p><\/div><br \/>\n<h3>Understanding the brand<\/h3>\n<p>One of the first exercises we conducted to understand how the LateRooms.com&#8217;s brand would work in the mobile space, was the tried and tested super hero question i.e. “If LateRooms was a superhero, what powers would you have?” Responses to this question included ‘speed’, ‘intelligence’, ‘slickness’ and remaining ‘one step ahead’ and it’s these we distilled into specific keywords to build upon.<\/p>\n<p><div id=\"attachment_5935\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Super_hero.png\"><img class=\"size-large wp-image-5935\" alt=\"Our superhero's attributes\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Super_hero-1024x749.png\" width=\"1024\" height=\"749\" \/><\/a><p class=\"wp-caption-text\">Our superhero&#8217;s attributes<\/p><\/div>\n<p>Using the three keywords below as a starting point we started creating moodboards.<\/p>\n<ul>\n<li>Functional &#8211; an experience that takes the user from A to B in the simplest way<\/li>\n<li>Experimental &#8211; an experience that is fresh and innovative<\/li>\n<li>Playful &#8211; the experience has a fun tone and does not take itself too seriously<\/li>\n<\/ul>\n<p>These simple moodboards helped us focus on the brand basics and in turn meant we could begin considering what the visual aesthetic might be for the proposition. It became clear that ‘playful’ and ‘functional’ worked in terms of visual language but ‘experimental’ was more applicable to UX.<\/p>\n<p><div id=\"attachment_5955\" style=\"width: 1034px\" class=\"wp-caption alignnone\"><img class=\"size-large wp-image-5955\" alt=\"Moodboards\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Moodboards-1024x749.png\" width=\"1024\" height=\"749\" \/><p class=\"wp-caption-text\">Moodboards<\/p><\/div><br \/>\n<h3>Prototyping<\/h3>\n<p>To start with we brainstormed user scenarios where people would need to book a hotel room. The core scenarios we focused on were users who:<\/p>\n<ul>\n<li>Needed a room in the short term (2 days in advance \/ weekend, a treat, celebration of anniversary, an event, business trip combined with weekend etc)<\/li>\n<li>Needed a room for that night &#8211; sense of emergency due to business (meeting), unpredictable situation (missed flight, drunk), romance, I have booked my flight but haven’t found a hotel in my destination yet and inspire me or show me some offers<\/li>\n<\/ul>\n<p>We then did a fast sketching exercise for each scenario, presenting the sketches back to the group in order to generate as many ideas as possible in an open environment. At this stage no idea is a bad one as emphasis is on strict timing to generate quick ideas before selecting the best.<\/p>\n<p>Generally the ideas fell into two areas:<\/p>\n<ul>\n<li>Map centric experiences – where we investigated the use of notifications on top of maps. We played with different interactions allowing the user could to swap between the two different views<\/li>\n<li>Time centric experiences – where we explored the comparison of results based on destination, user needs and transport<\/li>\n<\/ul>\n<p><div id=\"attachment_5928\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Sketches.png\"><img class=\"size-large wp-image-5928\" alt=\"Sketches from workshop\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Sketches-1024x749.png\" width=\"1024\" height=\"749\" \/><\/a><p class=\"wp-caption-text\">Sketches from workshop<\/p><\/div><br \/>\n<h3>Creating the right personality<\/h3>\n<p>So by focusing on our aim to achieve a playful yet functional UI experience, we set about looking at and improving the iconography. We introduced constant line weights and we brought in rounded corners in order to evoke a softer and more tactile feeling.<\/p>\n<p>We also looked at the motifs and asked ourselves how we could approach it in a more playful sense in order to inject fun into the whole experience.<\/p>\n<p>To tie the whole visual language together we decided upon an element that could be used through out &#8211; which was simply a smiley face.<\/p>\n<p><div id=\"attachment_5918\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/01\/icongoraphy.png\"><img class=\"size-large wp-image-5918\" alt=\"Iconography\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/01\/icongoraphy-1024x749.png\" width=\"1024\" height=\"749\" \/><\/a><p class=\"wp-caption-text\">Iconography<\/p><\/div>\n<p>Due to the nature of working in a cross discipline team with time constraints our focus was on making sure we had a smooth process that allowed the designers and developers to work more effectively and efficiently together. Using GitHub meant the developers avoided the pain of having to drag assets from the server to update the assets within the project and it was simple enough for the designers to use.<\/p>\n<p>The process worked was by producing an asset sheet for each section of the app, which was outputted using <a href=\"http:\/\/macrabbit.com\/slicy\/\">Slicy<\/a> to designated folders. Slicy was the perfect tool because once it was set up it featured recents + repeats which meant that any change to the original PSD automatically updated the assets. The next step of the process was to commit it to the repository via GitHub and to let the developers know that an update has been made – and hey presto we had the latest build.<\/p>\n<p><a href=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/01\/github.png\"><img class=\"alignleft size-large wp-image-5919\" alt=\"github\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/01\/github-1024x749.png\" width=\"1024\" height=\"749\" \/><\/a><\/p>\n<h3>Getting the concept into the product<\/h3>\n<p>Working to a tight time meant that we had to make some key decisions quickly including what elements from the initial direction we should or even could include in the finished product. An example was the decision whether we should create bespoke animation between the home page to the map results screen or add a key part of UX such as adding the next\/previous on the keyboard on the booking flow. We decided that the animation was not as vital to the product as making the best possible experience for the user.<\/p>\n<p>It was our goal to strike the right balance and make sure the product had all the features the business required as well as the right visual language and ideas we had in mind from the start of the process.<\/p>\n<p>Download the LateRooms.com app on <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.laterooms\">Android<\/a> or <a href=\"https:\/\/itunes.apple.com\/gb\/app\/laterooms.com-<br \/>\nhotel-booking\/id334701579?mt=8\">iPhone<\/a>.<\/p>\n<p><img class=\"alignnone size-large wp-image-5953\" alt=\"Finished\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2014\/02\/Finished-1024x749.png\" width=\"1024\" height=\"749\" \/><\/p>\n","date":"5 February 2014","link":"http:\/\/ustwo.localhost\/blog\/laterooms\/","category":"Process","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2014\/01\/Workshop_capture.png","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"61","facebook":"11","plus":"3","total":75},"layout":{"categoryClass":"process"},"extraClasses":"blog__articles__item--hero"},{"id":5629,"title":"Bitcoin: Beyond the bubble","excerpt":"Bitcoin has recently captured the public’s imagination in an unprecedented manner with its meteoric increase in price and high profile security breaches leaving many wondering whether this is a modern day Tulip mania.","content":"<p class=\"size-medium wp-image-5643\">Bitcoin, the digital cryptocurrency has recently captured the public&#8217;s imagination in an unprecedented manner. Most notably its meteoric increase in price and high profile security breaches have left many wondering whether this is a modern day <a href=\"http:\/\/en.wikipedia.org\/wiki\/Tulip_mania\">Tulip mania<\/a>. The result of this has been twofold, it has drawn attention from individuals, investors, and entrepreneurs wanting to jump on the bandwagon along with further scrutiny from the media and international governments wondering how to approach the regulation of this new form of financial instrument.<\/p>\n<p>The conceptual elegance of Bitcoin&#8217;s decentralised architecture and democratic philosophy afford it the opportunity to become the native electronic currency in the age of interconnected devices. Bitcoin also offers an entry point for fresh &amp; disruptive thinking in an era where our incumbent financial institutions seek short term profit instead of supporting the needs of individuals and SMEs. However, before this vision is realised, Bitcoin needs to overcome some key friction points before it can reach mainstream adoption, as listed below.<\/p>\n<div>\n<dl id=\"attachment_5643\">\n<dt><a href=\"http:\/\/www.flickr.com\/photos\/105644709@N08\/\"><img alt=\"\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/coins_medium-555x371.jpg\" width=\"555\" height=\"371\" \/><\/a><\/dt>\n<dd>Photo credit: Antana Coins on Flickr<\/dd>\n<\/dl>\n<\/div>\n<h3>Bitcoin is difficult to understand<\/h3>\n<p>Bitcoin is split into two sections conceptually. First up is the concept of ‘a Bitcoin’ as a unit of currency, and how it compares to the mental model of traditional FIAT money (any money declared by a government to be legal tender). One of the main stumbling blocks here is a matter of peculiar naming convention with ‘one Bitcoin’ not being the ideal base unit. Bitcoin is <a href=\"https:\/\/en.bitcoin.it\/wiki\/FAQ#How_divisible_are_bitcoins.3F\">highly divisible<\/a>, the problems is that fractions of a Bitcoin, unlike physical cash, don’t currently have readily accessible names for smaller denomination units e.g. 10, 20, 50p.<\/p>\n<p>Second of all, understanding the process of ‘mining’ which in essence consists of many volunteer individuals (miners) who collectively dedicate and pool computing power to generate new Bitcoins. Additionally the process of verifying and confirming transactions in the Blockchain (the open source ledger where all transactions are logged), also carried out by miners in return for transaction fees.<\/p>\n<p><div id=\"attachment_5646\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/ustwo.com\/blog\/bitcoin-beyond-the-bubble\/single2_4_1\/\" rel=\"attachment wp-att-5646\"><img class=\"size-medium wp-image-5646\" alt=\"\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/single2_4_1-555x536.jpg\" width=\"555\" height=\"536\" \/><\/a><p class=\"wp-caption-text\">The Buttefly Labs 5 GH\/s. One of many commercially available Bitcoin mining machines available on the market.<\/p><\/div>\n<p>These two aspects of Bitcoin are intrinsically linked. The latter aspect is particularly hard to grasp without having a fairly good grounding on the subject. Despite this, understanding how mining and the Blockchain work isn’t essential knowledge for those wishing to use Bitcoin in a transactional sense. In this respect, Bitcoin’s user experience could be greatly simplified by abstracting its transactional features into a more relatable model, akin to that of online banking to lower the learning curve for potential consumers.<\/p>\n<h3>High barrier of entry<\/h3>\n<p>Bitcoin is currently very difficult to buy. The current offering for individuals wishing to buy Bitcoin relies on using marketplaces or exchanges where there is ample opportunity for fraud and in some cases extremely lengthy and complex identity verification processes. This is one of the major hurdles Bitcoin currently faces. While many of these processes are in place to dissuade illicit activity, further simplification and improvement of security during entry experiences will go a long way in bolstering mainstream adoption.<\/p>\n<h3>Transactional complexity<\/h3>\n<p><div id=\"attachment_5670\" style=\"width: 224px\" class=\"wp-caption alignright\"><a href=\"http:\/\/ustwo.com\/blog\/bitcoin-beyond-the-bubble\/screen-shot-2013-11-27-at-09-13-30-5\/\" rel=\"attachment wp-att-5670\"><img class=\"size-full wp-image-5670\" alt=\"\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/Screen-Shot-2013-11-27-at-09.13.304.png\" width=\"214\" height=\"209\" \/><\/a><p class=\"wp-caption-text\">An example QR code generated from the Bitcoin address shown above.<\/p><\/div>\n<p>Currently, the transactional aspect of Bitcoin works on the basis of being able to transact sums of Bitcoin between two Bitcoin addresses, which are simply strings of 27-34 alphanumeric characters. E.g. 1757n7fia9o8kXT53zCSqYruUKR. These strings are the equivalent of email addresses, but are relatively unusable in their current guise. Some solutions have already surfaced in the form of visual QR codes, which can be scanned as a method of data entry. However, QR codes are still a long way from mainstream adoption, and therefore not quite the ideal solution to solve this problem.<\/p>\n<p>Another aspect of complexity with Bitcoin transactions is the application of transaction fees. Bitcoin has a <a href=\"https:\/\/en.bitcoin.it\/wiki\/Transaction_fees\">well defined structure<\/a> for situations in which transaction fees should be levied, however, transaction fees are currently fixed regardless of the amount being transferred. Consequently, due to the escalating price of Bitcoin, even small micropayments could be penalised with a transaction fee which exceeds the payment itself. This anomaly is proving to be a large friction point in the adoption of Bitcoin as a micropayment platform. Bitcoin transaction policy is likely to still be under development, but if not addressed soon could lead to considerable confusion and prove to be detrimental to Bitcoin’s uptake with individuals and merchants.<\/p>\n<h3>Security<\/h3>\n<p><div id=\"attachment_5677\" style=\"width: 138px\" class=\"wp-caption alignright\"><a href=\"http:\/\/ustwo.com\/blog\/bitcoin-beyond-the-bubble\/cube128-4\/\" rel=\"attachment wp-att-5677\"><img class=\"size-full wp-image-5677\" alt=\"\" src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/cube1283.png\" width=\"128\" height=\"128\" \/><\/a><p class=\"wp-caption-text\">Blockchain.info logo<\/p><\/div>\n<p>Any successful service utilising Bitcoin will need to match or exceed the security provided by competitors in order to gain the trust of consumers and gain credibility. Managing your Bitcoin requires taking a fairly large leap of faith in adopting one of the many wallet services. Recent headlines show just how vulnerable many wallet and exchange services are, leaving many out of pocket. Bitcoin wallet services draw many parallels with online banking\/payment portals. Given our <a href=\"http:\/\/www.designweek.co.uk\/ustwo-works-with-barclays-on-mobile-to-mobile-banking-app\/3034054.article\">own experience<\/a> helping craft cutting edge mobile-based payment platforms, we understand the importance of providing high quality user experience and security provision for these services to succeed, but ultimately wallet services need to engender trust.<\/p>\n<p>Given that even the most established wallets are <a href=\"http:\/\/www.coindesk.com\/blockchain-info-issues-refunds-to-bitcoin-theft-victims\/\">still vulnerable<\/a> there is a clear need for a new industry benchmark to emerge.<\/p>\n<h3>Conclusion<\/h3>\n<p>Bitcoin still is the preserve of the early adopters, but the tide is slowly turning. Part of driving adoption of Bitcoin for both individuals and businesses will rely in the creation of reliable &amp; secure services which attempt to address the issues mentioned above. Some notable examples where Bitcoin could radically change the landscape include the following:<\/p>\n<ul>\n<ul>\n<li>International money transfer (Retail banks, Western Union)<\/li>\n<\/ul>\n<\/ul>\n<ul>\n<ul>\n<li>Payment processors (Paypal, Visa, Mastercard, American Express)<\/li>\n<\/ul>\n<\/ul>\n<ul>\n<ul>\n<li>Reducing corruption through transparency (Banking, Government, Shadow economy)<\/li>\n<\/ul>\n<\/ul>\n<p>Leveraging the advantages of Bitcoin<br \/>\n over the offerings of current digital services will also gain many businesses a competitive advantage and help Bitcoin trigger a network effect encouraging further adoption. Bitcoin’s future lies in the hands of future thinking individuals, entrepreneurs and businesses wishing to use this disruptive new technology to change the way we think about, interact with and spend our money.<\/p>\n<h3>Further reading<\/h3>\n<ul>\n<ul>\n<li>Bitcoin <a href=\"https:\/\/en.bitcoin.it\/\">Wiki<\/a><\/li>\n<\/ul>\n<\/ul>\n<ul>\n<ul>\n<li>The original <a href=\"http:\/\/bitcoin.org\/bitcoin.pdf\">Bitcoin white paper<\/a> by Satoshi Nakamoto<\/li>\n<\/ul>\n<\/ul>\n<ul>\n<ul>\n<li>Bitcoin articles in <a href=\"http:\/\/techcrunch.com\/tag\/bitcoin\/\">TechCrunch<\/a><\/li>\n<\/ul>\n<\/ul>\n<ul>\n<ul>\n<li>Bitcoin articles in The <a href=\"http:\/\/www.economist.com\/topics\/bitcoins\">Economist<\/a><\/li>\n<\/ul>\n<\/ul>\n","date":"28 November 2013","link":"http:\/\/ustwo.localhost\/blog\/bitcoin-beyond-the-bubble\/","category":"Business","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/11\/coins_medium.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[{"author":{"name":"larsrose","email":"lars.rosengren@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"I think the challenge with Bitcoin at present is that its wrestling both with practical and philosophical challenges. A couple of the points that Joel mention was heavily debated the recent Bitcoin expo in London.\n\n\nThe idealists argue for Bitcoin being completely unregulated and under the radar of goverments, the realists argue that transparency and regulation is necessary for widespread adoption. Although not an expert on the topic, I think regulation would probably fundamentally stifle the concept of bitcoin, whereas transparency to a point is required to gain trust amongst the public.\n\n\nThe price volatility is quite natural as it concerns the perceptual value of something that has only been traded for a short time, lacks standardised market place and is conceptually difficult to understand and predict the future for. Independent of recent hype around bitcoin, it is likely to stabilise over time.","date":"2013-12-08 21:15:00"},{"author":{"name":"Joel Brydon","email":"joelbrydon@hotmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Dear Fisher,\n\nFirstly, what an absolutely splendid, thorough and insightful account of Bitcoin. Immensely enjoyable.\n\nThe key question I have with all of this is who actually owns Bitcoin and what (if any) bodies exist to regulate the currency? How can you apply monetary or fiscal policy on a currency that is essentially owned by no one, nor a particular unified body have a vested interest in or mandate to ensure the peaks and troughs in exchange rates are helped smoothed?\n\nCurrently, the volatility of Bitcoin is pretty wild. You can see swings in the $100's over the course of days. As such, I don't think we'll see mainstream adoption until stability can be witnessed through implementation of financial instruments by some kind of regulatory body.\n\nThought it was interesting too that Sir Richard B will be accepting Bitcoin on his Virgin Galatica space flights. Good old dicky. http:\/\/finance.yahoo.com\/blogs\/breakout\/sir-richard-branson-s-out-of-this-world-plan-for-bitcoin-190837979.html.\n\nYours in business,\n\nJB","date":"2013-12-02 06:03:00"}],"count":2},"social":{"tweets":"38","facebook":"42","plus":"0","total":80},"layout":{"categoryClass":"business"},"extraClasses":""},{"id":5575,"title":"So WTF is an MD in London going to be about?","excerpt":"Our London studio's newly appointed Managing Director, Scott Ewings talks openly about why he joined ustwo™, what having a MD actually means and how he will help create opportunity, whilst making sure we grow the right way.\n\nScott joins ustwo™ from Fjord, where he was Managing Director of the UK business from 2010, until its acquisition by Accenture Interactive in June 2013. Prior to Fjord, Scott was Strategy Director for Vodafone in Australia.\n","content":"<p>It’s fantastic to finally be here! Somebody asked me recently “why ustwo™?”. It’s a simple answer &#8211; it feels like home. ustwo™ for me is about the people first and foremost. But it’s also a lot about independence, experimentation, <a href=\"http:\/\/ustwo.com\/blog\/jfdi-so-many-words-so-little-time\/\">JFDI<\/a> mentality and total creativity. Revolutionary, and definitely not normal!<\/p>\n<p><a href=\"http:\/\/ustwo.com\/blog\/so-wtf-is-an-md-in-london-going-to-be-about\/large-3\/\" rel=\"attachment wp-att-5577\"><img src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/Large2-555x333.jpg\" alt=\"\" title=\"Scott profile\" width=\"555\" height=\"333\" class=\"aligncenter size-medium wp-image-5577\" \/><\/a><\/p>\n<p>So WTF is an MD in London going to be about? Well, I’ve been around the block, and I’ve been through the design studio growth thing a few times now, I’ve got the scars to show for it, so I can be useful! It’s really about opportunity and growing “the right way”.<\/p>\n<h3>Evolution in trends<\/h3>\n<p>Design is at a pivot point right now, and we are really well placed to do great things. There’s been a steady evolution in trends in digital design, from User Experience (90s\/early noughties), through to Customer Experience (mid noughties), Service &#038; Product design (now), and we are heading into something like Pervasive or Organic Design where the interface starts to go invisible and far less about screens. But these names are just repeated attempts to capture the fact that it’s important to design for the human. I know the design industry love to box things off this way, but I kind of think it&#8217;s not helpful.<\/p>\n<p><a href=\"http:\/\/ustwo.com\/blog\/so-wtf-is-an-md-in-london-going-to-be-about\/ustwolondon_nov_2013_01-2\/\" rel=\"attachment wp-att-5579\"><img src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/ustwoLondon_Nov_2013_011-555x370.jpg\" alt=\"\" title=\"ustwoLondon_Nov_2013_01\" width=\"555\" height=\"370\" class=\"aligncenter size-medium wp-image-5579\" \/><\/a><\/p>\n<h3>The Journey<\/h3>\n<p>ustwo™ have definitely been on their own journey through deep mobile experience into designing for the wider digital touch points, so we are well equipped for service design challenges, but I see us evolving into a very pure design firm &#8211; and by the way I make no distinction between design and development &#8211; it&#8217;s all design. Definitions are useful sometimes but inevitably limiting in the end. We&#8217;ve got the talent, the attitude and the cojones to take on any design challenge and get some great things done. We are rapidly growing, but success is not about getting bigger, it’s about doing ground-breaking work that makes a difference, and continuing to be an awesome place to work. So I’m here to help us grow with that top of mind always.<\/p>\n<p><a href=\"http:\/\/ustwo.com\/blog\/so-wtf-is-an-md-in-london-going-to-be-about\/ustwolondon_nov_2013_05\/\" rel=\"attachment wp-att-5583\"><img src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/ustwoLondon_Nov_2013_05-555x406.jpg\" alt=\"\" title=\"ustwoLondon_Nov_2013_05\" width=\"555\" height=\"406\" class=\"aligncenter size-medium wp-image-5583\" \/><\/a><\/p>\n<h3>The Future<\/h3>\n<p>So what does the future look like? No idea! None of us have a crystal ball, and the pace of innovation is ridiculous right now, everyone is trying to keep on top of things, but we do have a few key advantages right now. If you&#8217;re in the digital design space for any time at all you&#8217;ll have noted ustwo™ as &#8220;tiger in the bushes&#8221; for a few years now. For a highly profitable and rapidly growing studio we are remarkably less motivated by the money than by doing great work and making ustwo™ a great place to be.<\/p>\n<p>If you add our long-standing focus on experimenting with our own products, and increasingly moving into the ventures area, then you&#8217;ve got something really special. ustwo™ is a great mix of breakthrough thinking and getting things done, and that&#8217;s what you need now and ongoing, whether it&#8217;s client work or a venture. We are ambitious, sure, we want to take on the world, but it&#8217;s not about growth for its own sake. Ultimately this is a brilliant, passionate, learning team, and we are good to work with. Our clients and venture partners tell us that, and that’s gold.<\/p>\n<p><a href=\"http:\/\/ustwo.com\/blog\/so-wtf-is-an-md-in-london-going-to-be-about\/ustwolondon_nov_2013_02\/\" rel=\"attachment wp-att-5580\"><img src=\"http:\/\/ustwo.com\/wordpress\/wp-content\/uploads\/2013\/11\/ustwoLondon_Nov_2013_02-555x370.jpg\" alt=\"\" title=\"ustwoLondon_Nov_2013_02\" width=\"555\" height=\"370\" class=\"aligncenter size-medium wp-image-5580\" \/><\/a><\/p>\n<p>We are going to build on what&#8217;s already there and we’re ambitious enough to take things to a new level. We&#8217;ve got a platform to continue experimenting with developing our own IP, and that means we&#8217;ll continue to launch both our own products and do ventures with clients and partners. There&#8217;s a lot of ground-breaking client work under the hood, and we want to continue to grow that through being proactive and useful, but it&#8217;s certainly not just about fees for hours anymore. We want to be the &#8220;go to&#8221; for any design challenge, and I think that&#8217;s a great thing to continue striving for. We just want great work out there in the hands of humans, stuff that makes a difference. Design is a force for good, and we want to do good.<\/p>\n<p>Very pumped to be part of what’s next.<\/p>\n","date":"14 November 2013","link":"http:\/\/ustwo.localhost\/blog\/so-wtf-is-an-md-in-london-going-to-be-about\/","category":"Business","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/11\/Large2.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"4","facebook":"11","plus":"1","total":16},"layout":{"categoryClass":"business"},"extraClasses":""},{"id":5417,"title":"Conceiving the Future - the ustwo approach","excerpt":"If you're lucky enough to have numerous ideas for new customer products and services, you may find that selecting the best ones to move ahead with can be a more challenging process than you initially thought.\n\nMikael discusses the importance of having a cohesive strategy in place and demonstrates how we recently helped Skånetrafiken achieve that vision through a series of collaborative work exercises.\n\n","content":"<p>When you have a pool of ideas for customer products and services, it can be difficult making sure you move ahead with the best ones.<\/p>\n<p>We recently helped <a href=\"http:\/\/en.wikipedia.org\/wiki\/Sk%C3%A5netrafiken\">Skånetrafiken<\/a>, the public transport supplier of southern Sweden, make this decision by pulling together a cross functional team (including the client) and running through a series of lean UX exercises with a <a href=\"www.ustwo.co.uk\/blog\/jfdi-so-many-words-so-little-time\/\">JFDI<\/a> mindset.<\/p>\n<p>This process was extremely valuable to the client, creating some great concepts, as well as exploring new ways of looking at future business opportunities.<\/p>\n<p>We always advocate tight collaboration with our clients to maintain maximum momentum and creative output when it comes to projects. For us, it’s all about JFDI and co-creation, as this drives ideas through to strategy, action and reality.<\/p>\n<p><a href=\"http:\/\/www.ustwo.co.uk\/?attachment_id=5438\" rel=\"attachment wp-att-5438\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/ST_Blogquote_wide.png\" alt=\"ustwo™ approach quote\" title=\"ST_Blogquote_wide\" width=\"555\" height=\"234\" class=\"alignnone size-full wp-image-5438\" \/><\/a><\/p>\n<h3>Firstly, what do you want to achieve?<\/h3>\n<p>It’s clear that without a cohesive strategy in place, evaluating ideas can be <a href=\"http:\/\/insideintercom.io\/product-strategy-means-saying-no\/\">difficult<\/a>. So to start this process it’s best to begin with a clean slate by deliberately forgetting (not forever) all previously discussed ideas and instead think about how the organization should serve its customer differently in the future. By agreeing on a direction or vision you will have a guide to base all future decisions going forward.<\/p>\n<p>To achieve an aligned direction with the team at Skånetrafiken we organised a pre-meeting with a stakeholder group in order to get their input towards the vision of the project.<\/p>\n<p>This vision was the starting point we used to kick off the lean UX exercises with the cross functional team. It was a highly interactive phase where both ustwo™ and Skånetrafiken jointly set out the direction for the project and its desired outcomes. In essence we explored how public transport would and could serve it customers in the future.<\/p>\n<p>To define the vision further, it’s important to agree on what success is. How will you know you have succeeded? Define how these criteria for success will be measured and then make sure they are prioritized in order of importance.<\/p>\n<h3>Exercise: Define Desired Outcomes (one hour)<\/h3>\n<ul>\n<li>On post it notes, each team member writes down the differences expected to be achieved after delivering the output over time.<\/li>\n<li>Organize team members into groups of 3-6 people by mixing designers and clients in each group.<\/li>\n<li>Ask each group to organize their post it notes into common themes.<\/li>\n<li>Each group presents their themes.<\/li>\n<li>Prioritize the themes.<\/li>\n<\/ul>\n<p><a href=\"http:\/\/www.ustwo.co.uk\/blog\/conceptualizing-the-future-the-ustwo-approach\/st_blogimage1-2\/\" rel=\"attachment wp-att-5430\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/ST_Blogimage11-555x299.png\" alt=\"\" title=\"ST_Blogimage1\" width=\"555\" height=\"299\" class=\"aligncenter size-medium wp-image-5430\" \/><\/a><\/p>\n<h3>Know your customers<\/h3>\n<p>Do you know who your customers are? Post a short description of your user types up on a wall for everyone to focus on. Select the user types (1-5 personas) you think potentially will contribute the most to your vision. Define who these personas are, what their needs and barriers are today. Prioritize the personas by order of importance.<\/p>\n<h3>Exercise: Personas (half hour)<\/h3>\n<ul>\n<li>In the same groups.<\/li>\n<li>Give each group a persona to work with.<\/li>\n<li>Do empathy mapping for one persona per group.<\/li>\n<li>Each group presents their persona.<\/li>\n<li>Prioritize the personas.<\/li>\n<\/ul>\n<p> Learn more about empathy mapping <a href=\"http:\/\/www.gogamestorm.com\/?p=42\">here<\/a>.<\/p>\n<p>Now you’ll need to explore each persona’s user journey; what activities, needs and barriers do you see before, during and after the persona’s experience with your organization\/service. Map it out along a timeline.<\/p>\n<h3>Exercise: User Journeys (one hour)<\/h3>\n<ul>\n<li>In the same groups keep working with the same persona.<\/li>\n<li>Write down the activities for the persona; before, during and after the persona’s experience with your organization\/service on a timeline.<\/li>\n<li>Write down the needs the personas has during these activities.<\/li>\n<li>Each group presents their user journeys. Acting out the journey is encouraged.<\/li>\n<\/ul>\n<p><a href=\"http:\/\/www.ustwo.co.uk\/blog\/conceptualizing-the-future-the-ustwo-approach\/st_blogimage2\/\" rel=\"attachment wp-att-5431\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/ST_Blogimage2-555x295.png\" alt=\"\" title=\"ST_Blogimage2\" width=\"555\" height=\"295\" class=\"aligncenter size-medium wp-image-5431\" \/><\/a><\/p>\n<h3>Map the future<\/h3>\n<p>Once you’ve defined a vision and ways to measure success together with your primary personas and their journeys &#8211; it’s time to take all your new ideas that meet the needs identified, and mix them up with your previous ideas.<\/p>\n<p>Prioritize the ideas by finding those that are contributing most to the vision by supporting the users and their journey towards your desired outcomes.<\/p>\n<h3>Exercise: Map Ideas (one hour)<\/h3>\n<ul>\n<li>Each group brainstorms new ideas to support the needs of their persona through the user journey.<\/li>\n<li>Map all ideas to the user journeys.<\/li>\n<li>Prioritize ideas.<\/li>\n<li>Quickly prototype the best ideas.<\/li>\n<li>Each groups present their best ideas. Acting out is encouraged.<\/li>\n<\/ul>\n<p>In essence what you have now is a set of prioritized ideas mapped to user journeys that together form the basis of one or more product or service. These can easily be translated into future-gazing scenarios.<\/p>\n<p>After working through the above exercises in a cross functional team, we found that selecting the best ideas for Skånetrafiken was surprisingly easy, as each member was now aligned in thinking. This is one of the key reasons why workshops are so efficient &#8211; moving through many stages of the project in short time with a cross-company and cross-functional team reduces the overhead of summarizing and briefing.<\/p>\n<h3>Get your organization excited about the future<\/h3>\n<p>To help people outside the cross-functional team and in the organization as a whole understand the ideas and their purpose, you’ll need to find appropriate ways to communicate them. Be creative, make it visual. For example an image, a prototype, a video or a storyboard. Put the customer using the product at the centre of it all and show the value the service brings to them. In an upcoming blog post, we’ll tell you more about how we decided to communicate the ideas generated from the Skånetrafiken project.<\/p>\n<h3>Next &#8211; act on your vision<\/h3>\n<p>To be honest, what you have now is a hypothesis. A hypothesis about what products and services your customers will appreciate and that will lead to success for the organization. This hypothesis needs to be validated by iterating a “Build &#8211; Measure &#8211; Learn” loop. It’s all about  prototyping and testing it with your customers to learn and adjust accordingly.<\/p>\n<p>You can get a long way towards reaching your goals in just one workshop!<\/p>\n","date":"3 October 2013","link":"http:\/\/ustwo.localhost\/blog\/conceptualizing-the-future-the-ustwo-approach\/","category":"Process","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/10\/ST_Blogimage1.png","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"20","facebook":"0","plus":"6","total":26},"layout":{"categoryClass":"process"},"extraClasses":""},{"id":5369,"title":"How do you distil 3 ustwo studios down in to one fresh holiday cocktail?","excerpt":"The two London wizards of Studio Management, Jane and Matthew take a look back at some of the highlights of this years ustwo™ summer holiday in Croatia and from a logistics perspective, the difficulties in bringing together 135 ustwobies from different countries.","content":"<p> The summer holiday has been part of the ustwo™ experience from the very beginning. In previous years, the ever-expanding holidays have taken us to Wales, Cornwall, Fiskecampe in the south of Sweden (so nice we did it twice!) and, last year, Cascais in Portugal. 2013 marked the next generation of ustwo™ summer holidays. After nine years bringing together London and Malmö, we had the added ingredient of our shiny New York studio in the mix. <\/p>\n<div id=\"attachment_5400\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/garden_tisno-aerial\/\" rel=\"attachment wp-att-5400\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/garden_tisno-aerial-555x387.jpg\" alt=\"\" title=\"garden_tisno aerial\" width=\"555\" height=\"387\" class=\"size-medium wp-image-5400\" \/><\/a><p class=\"wp-caption-text\">Aerial view of Rastovac resort near Tisno<\/p><\/div>\n<p> The holiday is eagerly and not so patiently awaited as a time to unite ustwo™ brothers and sisters for their once-a-year opportunity for true togetherness, in a blissful location to soak up some Fampany vibes. The holiday is a singular event in the company calendar that crystallises the true sense of Fampany. <\/p>\n<h3> ustwo™ holiday 2013<\/h3>\n<p> This year, Croatia became our home from home. Three studios, three nights; 135 night-swimming, flat-out sunbathing, bar and BBQ-hopping ustwobies took over Rastovac resort near Tisno. Not your average corporate knees-up, but a special few days of creative thinking and drinking together. Each year the theme is simple: spend quality time with your fellow ustwobies. Make new friends. Build strong bonds and most of all, have an amazing time because you deserve it. <\/p>\n<div id=\"attachment_5393\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/img_1352-2\/\" rel=\"attachment wp-att-5393\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/IMG_13521-555x369.jpg\" alt=\"Bow\" title=\"IMG_1352\" width=\"555\" height=\"369\" class=\"size-medium wp-image-5393\" \/><\/a><p class=\"wp-caption-text\">Bow shot of HMS ustwo™<\/p><\/div>\n<p> From our point of view in the organisational committee (our very own ustwo™ ‘culture club’), we knew that this year was going to be a bigger fish to fry than our previous successful holidays. Portugal was going to be hard to top, so we had to pull out all the stops to make sure Croatia was blowing any previous holiday experiences out of the water. We had a huge undertaking on our hands: 135 attendees flying out from several different countries, finding accommodation to fit us all, and trying to ensure that all ustwobies with different interests and outlooks had a brilliant time together, no matter what. <\/p>\n<h3> The Power of Music<\/h3>\n<p> The solution to the problem was simple though. MUSIC. A common theme that seems to run through all ustwo holidays is the one essential tool with which to bring everyone together. We equipped a group of our budding ustwo DJs with the set up they needed at the ustwo™ beach bar, situated overlooking a beautiful Croatian cove and distant islands, and let them run the show. With music flows beer, eclectic dance moves, laughing, singing, hugging and an instant physical and emotional connection between the group. <\/p>\n<div id=\"attachment_5396\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/croatia2013_12-resize\/\" rel=\"attachment wp-att-5396\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/croatia2013_12-resize-555x370.jpg\" alt=\"\" title=\"croatia2013_12 resize\" width=\"555\" height=\"370\" class=\"size-medium wp-image-5396\" \/><\/a><p class=\"wp-caption-text\">Disco, disco, disco<\/p><\/div>\n<p> The ustwo™ holiday includes everyone, and we took seriously the potential to help create lasting bonds across the three studios. A handful of wide-eyed recent hires joined us, including one whose very first day began at Gatwick. There’s nothing like being thrown in at the deep end. <\/p>\n<h3> The ustwo™ Olympics<\/h3>\n<p> Our holiday presented the opportunity for some friendly competition amongst ustwobie teams. With the teams in place, we took a leap of faith and entered everyone into a “ustwo™ Olympics” where teams could race it out in three legged or flip flop relays to win the all important points at the end. It may have taken 40 minutes to raise enough gusto in our hung-over ustwobies to take part, but once the teams were lined up for the first race &#8211; you couldn’t hold back those who wanted to bring glory to their team. <\/p>\n<div id=\"attachment_5387\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/img_1180\/\" rel=\"attachment wp-att-5387\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/10\/IMG_1180-555x416.jpg\" alt=\"Tug of war\" title=\"IMG_1180\" width=\"555\" height=\"416\" class=\"size-medium wp-image-5387\" \/><\/a><p class=\"wp-caption-text\">The ultimate tug of war<\/p><\/div>\n<p> We couldn’t round off team sports without a Tug of War for the winners, and for the unfortunate losing teams, a nomination, or sacrifice, was made for the Chubby Bunny victim. Never underestimate the power of HR and a kilo of Marshmallows. <\/p>\n<h3> Sunset and Dolphins<\/h3>\n<div id=\"attachment_5375\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/img_7780\/\" rel=\"attachment wp-att-5375\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/09\/IMG_7780-555x370.jpg\" alt=\"Boat\" title=\"IMG_7780\" width=\"555\" height=\"370\" class=\"size-medium wp-image-5375\" \/><\/a><p class=\"wp-caption-text\">All aboard HMS ustwo™<\/p><\/div>\n<p> Before we knew it, the sun began to set on our final day in Rastovac, our ustwo™ holiday finale arrived at the jetty. A huge 150 person Party Boat, with an army of bartenders and shipmates hauling crate after crate of beer and spirits into the cabin. The ship took us out for an awe-inspiring trip around the Croatian islands with a sunset view, a school of dolphins swimming alongside and on board DJs setting the scene for our final night of partying on board. <\/p>\n<div id=\"attachment_5376\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/img_7943\/\" rel=\"attachment wp-att-5376\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/09\/IMG_7943-555x370.jpg\" alt=\"\" title=\"IMG_7943\" width=\"555\" height=\"370\" class=\"size-medium wp-image-5376\" \/><\/a><p class=\"wp-caption-text\">The perfect way to end a perfect holiday<\/p><\/div>\n<p> We’re all hyper connected by mobile and online tech, comfortable in the company of our digital companions with the names and faces we know and speak to so regularly. Yet there’s nothing else like stepping back and really engaging with each other within the holiday bubble. It’s deep in our DNA, so even as we grow – and it gets ever more complicated to make happen, we’ll keep stepping up to produce something amazing. <\/p>\n","date":"1 October 2013","link":"http:\/\/ustwo.localhost\/blog\/how-do-you-distil-3-ustwo-studios-down-in-to-one-fresh-holiday-cocktail\/","category":"Culture","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/10\/IMG_13522.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"7","facebook":"0","plus":"1","total":8},"layout":{"categoryClass":"culture"},"extraClasses":""},{"id":5231,"title":"The Include Design campaign round-up","excerpt":"Last year ustwo's Joe Macleod, founded the Include Design campaign. From ‘Tech City’, where the campaign originated, to Silicon Valley - its many supporters share in the conviction that design matters in education.\n\nJoe was asked by The National Society for Education in Art and Design (NSEAD), the leading national authority concerned with art, craft and design across all phases of education in the United Kingdom, to write an article for its member's magazine (AD Magazine), explaining how and why the campaign came about .","content":"<p>In November last year we read an <a href=\"http:\/\/www.theguardian.com\/education\/2012\/nov\/02\/arts-leaders-concerns-ebacc-schools\">article<\/a> by <a href=\"http:\/\/www.theguardian.com\/uk\">the Guardian<\/a> on the new <a href=\"http:\/\/en.wikipedia.org\/wiki\/English_Baccalaureate\">Ebacc qualification<\/a> and how it would effectively remove creative subjects from core education. The article focused on the high arts, and the impact removing creative subjects would have on education.<\/p>\n<p>From our perspective as designers, there was little mention in the article about the long-term potential impact on the design industry, as well as the UK economy as a whole. It seemed that the all too familiar battle lines had been drawn between academic and creative subjects. A focus on traditional academic subjects ostracizes those who fail to excel, offering no opportunity to explore other more creative areas of study.<\/p>\n<p>Unfortunately this is further compounded for those with learning difficulties. On a personal level, I found out quite late (21), that I was profoundly dyslexic. Despite this and because of design, I’ve luckily had a successful career from <a href=\"http:\/\/www.csm.arts.ac.uk\/\">St Martins<\/a>, RCA, Oyster (now called LBi), Orange, Nokia and now ustwo™.<\/p>\n<p>Ultimately, the anti creative subject mindset can discourage interest in pursuing employment in creative industries all together &#8211; something which concerned us so much, that we decided to do something about it.<\/p>\n<div id=\"attachment_5234\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-include-design-campaign-round-up\/includedesign_logo\/\" rel=\"attachment wp-att-5234\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/09\/includedesign_logo-555x83.png\" alt=\"Include Design logo\" title=\"includedesign_logo\" width=\"555\" height=\"83\" class=\"size-medium wp-image-5234\" \/><\/a><p class=\"wp-caption-text\">The Include Design Logo<\/p><\/div>\n<h3>Building momentum<\/h3>\n<p>We didn&#8217;t know much about politics or campaigning, but we used our networking skills to grow a digital audience, as well as set up a <a href=\"http:\/\/includedesign.org\/\">website<\/a> and <a href=\"https:\/\/twitter.com\/includedesign\">Twitter<\/a> account. Our first mission was to simply write a letter to Michael Gove (the Secretary of State) on behalf of like-minded companies in and around ‘<a href=\"http:\/\/techcity.io\/\">Tech City<\/a>’ &#8211; the digital area around London’s Shoreditch &#8211; expressing our collective concerns.<\/p>\n<p>We quickly built momentum within the industry and by the end of the first week, we had numerous local digital companies involved, as well as the <a href=\"http:\/\/www.designcouncil.org.uk\/\">Design Council<\/a>, Terrence Conran, Wayne Hemmingway, Edward Barber and Jay Osgerby. Our approach naturally changed as interest grew, and we found ourselves in the rarified position to be able send a letter on behalf of the design industry as a whole &#8211; a far bigger group than initially intended.<\/p>\n<p>By week three the campaign was on fire, with the cream of the design world behind it. Just when we thought it could not get better, and literally days before we were due to send our letter, we heard some exciting news that some significant leaders of the industry had committed their support including Jonathan Ive, Stella McCartney and Lord Foster.<\/p>\n<p>So with over 300 design companies and individuals backing the Include Design campaign, we sent our <a href=\"http:\/\/www.digitalartsonline.co.uk\/news\/creative-business\/uk-design-industry-tells-michael-gove-put-design-into-ebacc\/\">letter<\/a> to Michael Gove. We also reached out to the trade press who helped generate more noise surrounding the campaign, resulting in many more interested parties committing to the cause.<\/p>\n<div id=\"attachment_5237\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-include-design-campaign-round-up\/ebacc-5-medium\/\" rel=\"attachment wp-att-5237\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/09\/EBACC-5-Medium-555x375.jpg\" alt=\"Downing Street\" title=\"EBACC 5 (Medium)\" width=\"555\" height=\"375\" class=\"size-medium wp-image-5237\" \/><\/a><p class=\"wp-caption-text\">From Left to Right - ustwo&#039;s Joe Macleod , Kathryn James from National Association of Head Teachers, Marilyn Harrop from The National Union of Teachers and Deborah Annetts the co-ordinator of the baccforthefuture campaign<\/p><\/div>\n<h3>Sustaining interest<\/h3>\n<p>Our aim was to sustain interest in the campaign, so we came up with various initiatives to help us achieve that goal. One example was something called ‘6 minutes for creativity’. We asked our supporters to dedicate 6 minutes at 11am on the 21st December to raise awareness of creative subjects being excluded from core education. This was highly successful generating lots of press interest and even saw us trending on Twitter. Throughout January the campaign continued to grow.<\/p>\n<p>On the 6th February, I heard some great <a href=\"http:\/\/www.telegraph.co.uk\/education\/educationnews\/9854520\/Michael-Goves-GCSE-U-turn-how-EBacc-was-scrapped.html\">news<\/a>. Michael Gove was to announce a U-turn the following morning in the House of Commons. That day he backed down from his proposals on the Ebacc and re-established creative subjects within core education &#8211; this was a massive victory for all of us.<\/p>\n<p>Following this our approach shifted from raising awareness of the campaign, to focusing on ways of improving the design curriculum. So in partnership with the <a href=\"http:\/\/www.designcouncil.org.uk\">Design Council<\/a><\/a>, the <a href=\"https:\/\/www.data.org.uk\/\">Design &#038; Technology Association<\/a> and the <a href=\"http:\/\/www.thesorrellfoundation.com\/\">Sorrell Foundation<\/a>, we’ve been working hard, re-writing parts of the curriculum as well as advising on the elements that the Design industry would be expecting from it.<\/p>\n<div id=\"attachment_5248\" style=\"width: 400px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-include-design-campaign-round-up\/includedesign_6mins_poster_croped-3\/\" rel=\"attachment wp-att-5248\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/09\/includedesign_6mins_poster_croped2-390x555.jpg\" alt=\"‘6 minutes for creativity’\" title=\"includedesign_6mins_poster_croped\" width=\"390\" height=\"555\" class=\"size-medium wp-image-5248\" \/><\/a><p class=\"wp-caption-text\">‘6 minutes for creativity’ initiative<\/p><\/div>\n<h3>Ongoing improvement<\/h3>\n<p>Speaking with experience of recruiting around four designers a month, I know for a fact we need to improve design education. The future quality in any national curriculum has to be driven and benchmarked by competition internationally, as this will keep standards as high as possible. It’s this market that will challenge our relationship with paper qualifications, curriculum content, distance learning and design processes.<\/p>\n<p>This period of much needed self-reflection for design education, is the perfect starting point to assemble a better, more rigorous curriculum. There are of course enormous challenges ahead, but I have been genuinely humbled by the speed and passion in which the industry has rallied behind this important issue.<\/p>\n<p>Design should be a corner stone of our national curriculum for one crucial reason. Where academic subjects encourage pupils to coldly recall information, design permits pupils to think confidently about the unknowns of the world &#8211; ultimately creating visionaries of the future who can apply design process and thinking to a diverse range of problems.<\/p>\n<p><em>This article originally appeared in <a href=\"http:\/\/www.nsead.org\/publications\/ad.aspx\">AD<\/a> issue #8, the NSEAD members&#8217; magazine. The <a href=\"http:\/\/www.nsead.org\/home\/index.aspx\">National Society for Education in Art and Design<\/a> (NSEAD), is the leading national authority concerned with art, craft and design across all phases of education in the United Kingdom.<\/em><\/p>\n","date":"13 September 2013","link":"http:\/\/ustwo.localhost\/blog\/the-include-design-campaign-round-up\/","category":"Design","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/09\/EBACC-5-Medium.jpeg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[{"author":{"name":"robertpataki","email":"robert@robertpataki.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Initiatives like this and the Tech City Apprenticeship are the perfect examples of how the creative industry helps its graduates\/newcomers  through real market demand focused education. It's great to see that something really extraordinary is happening and the epicentre is right in the middle of the Silicon Roundabout. Proud™","date":"2013-09-13 12:18:00"}],"count":1},"social":{"tweets":"23","facebook":"0","plus":"5","total":28},"layout":{"categoryClass":"design"},"extraClasses":""},{"id":5124,"title":"Infusing brand spirit into the UI of KNOPKA","excerpt":"Defining, capturing and incorporating a personality in a digital service helps create a unique and truly engaging user experience. Tobias Arréhn looks at the importance of personality and emotion within design.\n\nUsing our recent work creating a ground-breaking financial service for entrepreneurs called KNOPKA, Tobias highlights some of the key elements and magic touches that helped define the final product.","content":"<p>Over the last six months, ustwo™ Malmö has been working with <a href=\"http:\/\/www.bank24.ru\">Bank24.ru<\/a> as part of a collaborative dream team, to help build a ground-breaking financial service for entrepreneurs in Russia. It was a truly exciting project to be involved with &#8211; we had a blank canvas to build something from scratch, a global team of best in class collaborators and a client who lived and breathed our <a href=\"http:\/\/www.ustwo.co.uk\/blog\/jfdi-so-many-words-so-little-time\/\">JFDI<\/a> approach.<\/p>\n<p> We kicked off the project with a focus on entrepreneurs, and from this developed initial ideas for a service designed to help them run their businesses more efficiently. During early prototyping it became important that we defined exactly how the brand should be represented within the design.<\/p>\n<p>The brand was in the process of being developed by <a href=\"http:\/\/www.michaelwolff.eu.com\">Michael Wolff<\/a>, <a href=\"http:\/\/www.nbstudio.co.uk\/\">NB Studio<\/a> and <a href=\"http:\/\/daljit.tumblr.com\/\">Daljit Singh<\/a>, so together we began exploring what it might look and feel like as part of a digital service. The digital brand had to be simple and easy enough for anyone to understand. The service was therefore named KNOPKA meaning button.<\/p>\n<div id=\"attachment_5139\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-timeline-desktop\/\" rel=\"attachment wp-att-5139\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-Timeline-desktop.png\" alt=\"KNOPKA timeline\" title=\"Knopka-Timeline-desktop\" width=\"555\" height=\"370\" class=\"size-full wp-image-5139\" \/><\/a><p class=\"wp-caption-text\">A desktop view of KNOPKA&#039;s user timeline<\/p><\/div>\n<p>KNOPKA’s brand visual identity consisted of simple buttons, the Futura font and a rich palette of colours &#8211; kept flat, yet iconic. To mirror this, the UI design was stripped down removing unnecessary information, but it soon became clear that conveying the unique KNOPKA brand spirit through something so flat and simple would be challenging. To help us capture both an emotive experience and sense of brand ‘magic’, we brought together Michael Wolff, NB Studio and Daljit Singh for a one day emotive UI exploration workshop.<\/p>\n<h3>UI personality workshop<\/h3>\n<p>To begin with, we started discussing some examples of magical moments in life (like your first kiss or the smell of fresh coffee), and how these might translate into digital expressions. We then explored how the spirit of KNOPKA might manifest itself as a real character, for example a little cheeky girl, a faithful dog or a loving aunt.<\/p>\n<p>The focus was not on what they looked like physically, but instead how they might behave or act in certain situations from sign in, to sharing news or displaying an error message. Throughout the process the different characters we came up with all consisted of unique elements that personified the core brand experience, but none of them captured the KNOPKA’ness we wanted within the UI.<\/p>\n<p>After considering various options, it finally struck us that it was not a person or animal we were looking for, but instead the lovable <a href=\"http:\/\/en.wikipedia.org\/wiki\/R2-D2\">R2-D2<\/a> from Star Wars. His characteristics matched the overall brand experience in all manners with key attributes including playfulness, loyalty, efficiency, cheekiness, trustworthiness, problem solving skills, message carrying, etc.<\/p>\n<div id=\"attachment_5136\" style=\"width: 559px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-r2d2\/\" rel=\"attachment wp-att-5136\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-r2d2-549x555.gif\" alt=\"R2 - D2\" title=\"Knopka-r2d2\" width=\"549\" height=\"555\" class=\"size-medium wp-image-5136\" \/><\/a><p class=\"wp-caption-text\">A sketch of R2-D2 highlighting key character attributes<\/p><\/div>\n<p>So with a character in mind, we sketched out some ideas in order to capture the spirit of R2-D2, and ways in which we could go about incorporating elements of this into the UI.<\/p>\n<div id=\"attachment_5135\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-elementssketches\/\" rel=\"attachment wp-att-5135\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-ElementsSketches.gif\" alt=\"KNOPKA elements\" title=\"Knopka-ElementsSketches\" width=\"555\" height=\"275\" class=\"size-full wp-image-5135\" \/><\/a><p class=\"wp-caption-text\">Key elements sketched out<\/p><\/div>\n<p>After the workshop we immediately began experimenting with different motion and interaction patterns, as well as sound effects to identify how best to represent R2-D2’s unique personality throughout the UI.<\/p>\n<h3>Bringing icons to life<\/h3>\n<p>Since the UI was icon focused we really wanted to bring them to life with that extra KNOPKA character, and we did this by giving them their own individual animations. For example, the login button’s key icon spins when pressed, the money icon sparkles and the accountant icon blinks. This was a playful, subtle and engaging way of bringing some magic into the experience.<\/p>\n<div id=\"attachment_5138\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-hovericons\/\" rel=\"attachment wp-att-5138\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-HoverIcons.gif\" alt=\"KNOPKA icons\" title=\"Knopka-HoverIcons\" width=\"555\" height=\"70\" class=\"size-full wp-image-5138\" \/><\/a><p class=\"wp-caption-text\">KNOPKA icons with motion and a touch of character<\/p><\/div>\n<h3>Emotion through motion<\/h3>\n<p>There’s no better way to express what’s going on in a UI than using motion design. A simple example of this is when there’s a failed attempt to login with the wrong password &#8211;  the login button shakes and a specific yet subtle sound effect reiterates the issue. It’s similar to when R2D2 shuffles from side to side making his distinctive sound when he’s upset.<\/p>\n<div id=\"attachment_5150\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-loginerror\/\" rel=\"attachment wp-att-5150\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-LoginError.gif\" alt=\"KNOPKA login error\" title=\"Knopka-LoginError\" width=\"555\" height=\"350\" class=\"size-full wp-image-5150\" \/><\/a><p class=\"wp-caption-text\">Login error screen with motion<\/p><\/div>\n<h3>Guiding the user through animations<\/h3>\n<p>Something we value highly here is making sure a user really understands where they’re navigating to, where they came from, and even more importantly, where the things they’ve created end up within the UI. We’ve found that motion is an extremely powerful tool for helping users understand things as clearly as possible.<\/p>\n<div id=\"attachment_5137\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/knopka-payment\/\" rel=\"attachment wp-att-5137\"><img src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Knopka-Payment.gif\" alt=\"KNOPKA payment\" title=\"Knopka-Payment\" width=\"555\" height=\"416\" class=\"size-full wp-image-5137\" \/><\/a><p class=\"wp-caption-text\">An example of motion to show that a successful payment has been made<\/p><\/div>\n<h3>Finding a balance<\/h3>\n<p>It’s really important to keep in mind that embodying the spirit of a unique character in a UI should be carefully considered. By overdoing it in certain instances you can hinder the user’s experience in completing a task. But there are occasions where overdoing it, may actually be just right.<\/p>\n<p>Looking back at an exciting journey over the last six months we can only hope that one day you will sign up* for a <a href=\"http:\/\/www.knopka.com\/\">KNOPKA account<\/a> and literally start ‘feeling’ the KNOPKA brand.<\/p>\n<p>* you will need to be able to understand Russian.<\/p>\n","date":"28 August 2013","link":"http:\/\/ustwo.localhost\/blog\/infusing-brand-spirit-into-the-ui-of-knopka\/","category":"Design","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/08\/Knopka-r2d2.gif","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[{"author":{"name":"Arkadiy Mochulsky","email":"a.mochulskij@ya.ru","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"That's amazing. The animation is outstanding","date":"2013-10-26 10:33:00"},{"author":{"name":"Nuno Coelho Santos","email":"nuno@nunocoelhosantos.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"This is such an outstanding piece of work. It's great that you shared the UI personality and the challenges of using such a modern style but convey emotion with it. The use of motion is stellar.","date":"2013-08-28 16:29:00"}],"count":2},"social":{"tweets":"40","facebook":"4","plus":"7","total":51},"layout":{"categoryClass":"design"},"extraClasses":""},{"id":5046,"title":"3 Myths of Digital Product Creation","excerpt":"The theme at Media Evolution's The Conference 2013 is \"Power, Disruption and Lies\" (inspired by New Order's album).\n\nThe Media Evolution team invited us to get involved by writing a blog post around this year's theme. Mikael Lindh therefore decided to take a look at three industry lies (well myths) to get the conversation going.","content":"<p>The theme at Media Evolution&#8217;s <a href=\"http:\/\/mediaevolution.se\/theconference\">The Conference 2013<\/a> is &#8220;Power, Disruption and Lies&#8221; (inspired by New Order&#8217;s album).\n<p>The Media Evolution team invited us to get involved by writing a blog post around this year&#8217;s theme. I&#8217;ve therefore decided to take a look at three industry lies (well myths) to get the conversation going.\n<p>The process of digital product creation is evolving so quickly that approaches we used a year or two ago are already verging on being redundant. We therefore thought we’d compile a list of things that we believe have changed, as well as suggest a shift in perspective designed to face the challenges of future digital product creation.<\/p>\n<p>\n<h3>Myth 1: More upfront research = less risk<\/h3>\n<p>\n<p>Betting too much on knowledge gained early in a project is very risky. Even if you have THE big idea, things always change. An example of this is the Scandinavian bank SEB. It was recently reported that SEB ‘wasted’ millions developing an internet bank service that was never used. How could this happen? They had done their research. In 2006 they conducted extensive research and requirements gathering activities to prepare them for the future of banking. In 2007 the iPhone arrived, and shortly after the concept of mobile banking (something inconceivable on 2006’s mobile devices). Unfortunately SEB’s new internet banking system could not effectively support mobile banking without further substantial investment. SEB eventually decided to kill the project 5 years later, with an <a title=\"Article about SEB\" href=\"http:\/\/computersweden.idg.se\/2.2683\/1.489832\/seb-skrotar-ny-natbank---750-miljoner-i-sjon\">estimated loss of 750 million Swedish crowns<\/a>.<\/p>\n<p>\n<p>Obviously this is an extreme case. However all projects have hidden risks associated to unforeseen changes in markets or industries. To minimize risk, we believe in conducting enough research to formulate hypotheses for project success. We then test these hypotheses, reformulate them and test again. We are not afraid to kill ideas that do not work. We are not suggesting less research, but rather a continual iterative research approach that can run in parallel to other activities. If SEB had taken a similar approach, they would have been more responsive to change.<\/p>\n<p>\n<p>This summer we have been working closely with Skånetrafiken, the public transport supplier of southern Sweden. Instead of an extensive research phase we facilitated a series of Lean UX workshops. We helped distil their many different ideas and directions into a set of prioritized hypotheses. These hypotheses are now ready to be tested and refined together with their users with minimal risk.<\/p>\n<p>\n<h3>Myth 2: More fuel makes an engine go faster<\/h3>\n<p>\n<p>It is a common mistake to believe adding more people will speed up a project. This is a lie (Well sort of.) Bigger teams can get things done quicker, but not proportionally. If you have a project that takes a team 10 weeks to design and develop, doubling the team will not ensure that the project is completed five weeks earlier. With the introduction of each new member, the need for greater co-ordination and communication multiplies. Add to this that it is more difficult to foster a culture of ownership and that bigger teams are less responsive to changes in direction, and the benefit of “throwing in” a couple of extra people is vastly reduced in a project that is striving to be agile.<\/p>\n<p>\n<p>This is why we like to keep our teams small. Initially we work in small teams to create a minimum viable product. Later we scale the team organically based on project needs and with the aim of always retaining the commitment to the final product. A clear example of this is our disruptive photo sharing service Rando. It was built by a two-person team over the course of a few weeks and has to date transported more than 12.5 million randos between completely random users. The team owned the product from start to finish and the feature-set was entirely focused around the minimum viable product. <a title=\"Rando site\" href=\"http:\/\/rando.ustwo.se\/\">Download Rando and see what a two person team achieved in just a few weeks.<\/a><\/p>\n<p><div id=\"attachment_5064\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/3-myths-of-digital-product-creation\/rando_3_platforms\/\" rel=\"attachment wp-att-5064\"><img class=\"size-medium wp-image-5064\" title=\"Rando_3_platforms\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Rando_3_platforms-555x234.jpg\" alt=\"Rando\" width=\"555\" height=\"234\" \/><\/a><p class=\"wp-caption-text\">From idea to app in a few weeks<\/p><\/div><br \/>\n<h3>Myth 3: Knowing “Agile” equals success<\/h3>\n<p>\n<p>This is not true. Stop hiding behind process, methods and tools! Even though we are huge fans of Agile, Scrum and Lean we believe other factors are more important when it comes to creating success. Dig deeper! You&#8217;ll need a group of passionate people who care about each other and the projects they work with. It needs to be a genuine value of your organization. It&#8217;s not just about &#8220;implementing Agile&#8221;. If two assholes read the same book about Agile, they will still be assholes.<\/p>\n<p>\n<p>Focus on people over processes and tools. This is ironically a cornerstone of the Agile manifesto that is commonly overlooked. At ustwo we believe motivated people can work with minimal management. Rather than having project managers chasing deliverables, we use team coaches to oil the machine and make sure the engine runs smoothly. Focus on HOW the team works together instead of WHAT the team is delivering.<\/p>\n<p>We invest in our unique culture known as Fampany (family + company). Fampany is about caring for each other, but also being passionate about what we do. It is a culture of empowerment and ownership that manifests itself in our uniquely crafted digital products. We believe this is the foundation of our success.<\/p>\n<p><div id=\"attachment_5057\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/3-myths-of-digital-product-creation\/studio\/\" rel=\"attachment wp-att-5057\"><img class=\"size-medium wp-image-5057\" title=\"Studio\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/Studio-555x341.jpg\" alt=\"Fampany\" width=\"555\" height=\"341\" \/><\/a><p class=\"wp-caption-text\">Fampany<\/p><\/div>\n<p>Do you agree? Disagree? Let us know your favorite lies. Tweet your <a title=\"Twitter #DigitalLies\" href=\"https:\/\/twitter.com\/search?q=%23DigitalLies\">#DigitalLies<\/a> or add them as comments below. See you at <a title=\"The Conference\" href=\"http:\/\/mediaevolution.se\/theconference\/\">The Conference<\/a>!<\/p>\n","date":"15 August 2013","link":"http:\/\/ustwo.localhost\/blog\/3-myths-of-digital-product-creation\/","category":"Process","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/08\/Studio.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[{"author":{"name":"Boyd","email":"boydrusselldesign@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"I love the truth &amp; honesty in this post, I agree fixed processes \/\"new traditions\" can act the song and dance but only end up playing distractive.\n\nRather explore what feels right with the user\/client allowing for low fidelity prototypes and frequent concept reviews to determine the appropriate direction to be taken.\n\nLoving your companies ethos! ","date":"2013-09-30 01:38:00"},{"author":{"name":"Paw","email":"paw.marques@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Great point about research Keir, it's not about dumping a 100 page deep research analysis document and expecting the rest of the project to magically fulfil every need and edge case - however true and real they all are - it's about knowing what to focus on, communicating the important insights, and which parts of the research to act upon and iterate further down the road.\n\nHowever I have an issue with the SEB example, I wonder if relying on too much research upfront was the only problem, seems to me that being unable to turn the ship around in 5 years is more a problem of too much \"corporate inertia\" than heavy research. But interesting example nevertheless!","date":"2013-08-19 11:03:00"},{"author":{"name":"Keir","email":"keirroyale83@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Great post, I tend to agree with all three points.\n\nI believe some processes are in place as guide and not strict set of rules. Not all projects are the same and could do with a little shake up every now and again. Some times when processes are followed to letter, not a lot gets done. At times there is too much talking and not enough designing going on.\n\n\nAlso, (as a UX designer) I feel research is a key part of the design process and always brings up conflicting results. Its up to the UX people\/people carrying out the research to pick out the key findings and the most interesting insights, otherwise nothing will get designed if we rely on all the research gathered. Also keeping up with emerging trends and technology is a must, so companies don’t get caught out.","date":"2013-08-16 15:57:00"}],"count":3},"social":{"tweets":"40","facebook":"0","plus":"3","total":43},"layout":{"categoryClass":"process"},"extraClasses":""},{"id":5027,"title":"It&#039;s All About the Money, Money","excerpt":"\nMobility and the internet are changing the way that money is moving around the world, and existing financial institutions, brands and services each have their own vision of what the future of payments is.\nHowever, Paul Gates asks the question whether these new forms of payment are actually relevant to the people that are going to be using them most in the immediate future—Generation Y.","content":"<p>Or more so, it’s all about how future users of digital banking programs think about their money, money. Over the past few years many major financial establishment have been digitizing their businesses, offering mobile wallet type apps allowing users to look at their expenses while on the go and perform fundamental functions like transferring money. But beyond glancing at their spending or sending money to others, there was little else the user could do with these apps. Then third party products like Apple’s Passbook, Google Wallet and Square Wallet started offering new ways to purchase products using smart phones.<\/p>\n<p>Since the release of these applications and services, there has been little adoption in part due to market fragmentation, with impracticality coming in close second. Considering all versions of digital cardholders, NFC payment tools, and banking applications, there seemed to be something missing. <strong>The user’s needs.<\/strong><\/p>\n<p><div id=\"attachment_5028\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/2.jpg\"><img class=\"size-medium wp-image-5028\" title=\"Mobile Payment Apps\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/2-555x263.jpg\" alt=\"Three iPhones showing screenshots of Apple Passbook, Lemon Wallet and Square, and an Android phone showing Google Wallet\" width=\"555\" height=\"263\" \/><\/a><p class=\"wp-caption-text\">Apple Passbook, Lemon Wallet, Square &amp; Google Wallet<\/p><\/div>\n<p>Within ten years, Gen Y will make up almost 70% of the work force. To date, the younger group controls some $2 Trillion, yet in eight years they will be in control of $28 Trillion (<a href=\"http:\/\/online.barrons.com\/article\/SB50001424052748703889404578440972842742076.html\" target=\"_blank\">Barron’s millennials on the rise<\/a>). Bearing this in mind, companies will do well to get to know their upcoming customers. Unlike their former generations that have a record of financial responsibility and strategic spending, Gen-Y may force banks to re-think their services towards newer, unconventional financial behaviors.<\/p>\n<p><div id=\"attachment_5029\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/3.jpg\"><img class=\"size-full wp-image-5029\" title=\"Three Gen-Y personalities\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/3.jpg\" alt=\"Six young people standing against a wall, a mix of ethnicities and genders but all look quite cool. Text is written above them, “Practical Bohemian”, “Free Spirited Shopper”, and “Budget Playboy”.\" width=\"555\" height=\"315\" \/><\/a><p class=\"wp-caption-text\">Three Gen-Y personalities<\/p><\/div><br \/>\n<h3>Understanding the Needs of Gen-Y<\/h3>\n<p>To better understand Gen-Y, we held a series of user interviews uncovering a series of behavioral patterns. Combined with general market research, we uncovered three “personalities” that best describe this mid to late twenties group.<\/p>\n<ol>\n<li><strong>The Free-Spirited Shopper<\/strong>—lives in the moment by buying goods for herself and others.<\/li>\n<li><strong>The Practical Bohemian<\/strong>—spends limited amount of money on finer cultural &amp; health experiences.<\/li>\n<li><strong>The Budgeted Playboy<\/strong>—careful spender, but likes showing off new-found wealth to others.<\/li>\n<\/ol>\n<p>What do the three have in common? They’re not big savers. Perhaps the greatest differentiator from past generations is the evolved perception of what it means to invest. An investment to a Gen Y’er is pair of designer shoes that will wear well for 5 years, demonstrate their suave style, and boot their social self-esteem. It’s the generation most likely to invest in travel – a trip to Croatia with 12 buddies will “shape their life experience” and promise memories that can’t be replaced (and Gen Y’ers looooove life experiences).<\/p>\n<p>Research shows Gen Y likes to live in the moment and spends money on their immediate well-being. They enjoy sharing experiences with others and will look to others for guidance when they are uncertain about a financial decision. Although digitally savvy and experts on buying online\/offline, Gen-Yers are not early adopters of technology and are also the biggest group that visit brick &amp; mortar bank branches and call centers. They feel comfortable and confident in their spending habits, but the majority of this group is financially illiterate (<a href=\"http:\/\/usatoday30.usatoday.com\/money\/perfi\/basics\/story\/2012-04-23\/millenials-financial-knowledge\/54494856\/1\" target=\"_blank\">The cost of financial illiteracy<\/a>).<\/p>\n<h3>Gen-Y Financial Application Opportunities<\/h3>\n<p>All things considered, where do we see opportunities for financial groups when creating value products for Gen-Y? As opposed to building another iteration of the mobile wallet, we see more market growth opportunities in the following:<\/p>\n<ol>\n<li>Creating a recommendation system that’s not in your face, but instead encourages behavior in line with the customers’ goals. Banks will do well to get to know their customer’s goals.<\/li>\n<li>Increase the feeling of security and control. While Gen Yers like to have auto-pay systems in place, they still prefer to be the command center. Gen Y’ers want to push the “pay” button. Even if reminders are implemented, build systems around the concept of customer control.<\/li>\n<li>Create a unified platform for group expenses and transactions. Gen Y’ers like to share. Offering a tool that brings visibility to group expenses and provides a platform for peer to peer payment will go far with this group.<\/li>\n<li>Umbrella financial services, offering many targeted services—from taxes and business solutions to insurance and personal lifestyle. Remember this group is “financially illiterate.” The more supported they feel, the more likely they are to use services offered.<\/li>\n<\/ol>\n<h3>Final Thoughts<\/h3>\n<p>So is digitizing your business going to get you Gen-Y customers? It might help, but it’s unlikely to build long–term relationships. Creating an application for monitoring personal finances is a great starting point, but business should consider getting to know their potential users and implementing features catered to user lifestyles, spending styles, and financial goals. <em><\/em><\/p>\n<p><em>Paul collaborated with Oylum Boran, Jaci Pearse and Pedro Sepulveda to run user research and create this post. This cross-discipline team brings years of experience from different fields to contribute to the New York ustwo™ studio.<\/em><\/p>\n","date":"8 August 2013","link":"http:\/\/ustwo.localhost\/blog\/its-all-about-the-money-money\/","category":"UX","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/08\/2.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"14","facebook":"0","plus":"1","total":15},"layout":{"categoryClass":"ux"},"extraClasses":""},{"id":4982,"title":"Digitally Engaged","excerpt":"\nWe've given up on trying to figure out how much productivity is lost by ustwo™ staff getting up from their desks, walking to the loos, only to find that they're engaged and sitting back down again. Juan Delgado tells us how he used magnet sensors, an Arduino and an API to solve a problem anyone who's been to ustwo™ London has experienced.","content":"<p>At <a title=\"ustwo\" href=\"http:\/\/www.ustwo.co.uk\/\">ustwo™<\/a> we have been looking into the Internet of things including sensors, actuators, Arduinos and all that jazz.<\/p>\n<p>With the price of hardware so cheap and off the shelf platforms (<a title=\"Ninja Blocks\" href=\"http:\/\/ninjablocks.com\/\" target=\"_blank\">Ninja Blocks<\/a>, <a title=\"Berg Cloud\" href=\"http:\/\/bergcloud.com\/\" target=\"_blank\">Berg Cloud<\/a>) making it so easy to get involved, we have a new set of solutions looking for a new set of problems to be solved.<\/p>\n<p>Our problem: resolving the anti-usability and efficiency issues surrounding our studio toilets—the perfect opportunity to get our hands dirty (ahem).<\/p>\n<p><strong>The problem<\/strong><\/p>\n<p>In our London studio it’s impossible to see if the toilets are busy or not as both loos are behind a door that doesn&#8217;t allow us to see whether they&#8217;re engaged or not. Everyday people would walk to this door, open it and then DOH… engaged.<\/p>\n<p><strong>The solution<\/strong><\/p>\n<p>Like the kind you’d find in planes and trains, we simply needed indicators that with one glimpse would show whether the toilets were busy or not. But it wasn’t as simple as that, as our floor plan meant that not everyone in the studio had that much needed direct line of sight to the all-important indicators.<\/p>\n<p>The reality is that when you have to go, you have to go. Therefore if the toilets on your floor are busy, you probably don’t mind a swift walk to the toilets on the other floors.<\/p>\n<p>So with this in mind we threw some technology at the problem and this is how it works:<\/p>\n<ul>\n<li>Magnet sensors in each of the toilet doors all wired up to an Arduino<\/li>\n<\/ul>\n<p><div id=\"attachment_5021\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-5021\" title=\"Magnet in the door frame\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/08\/door.jpg\" alt=\"A painted blue door frame with an area of the paint scratched off with what looks like a magnet set into the frame\" width=\"555\" height=\"320\" \/><p class=\"wp-caption-text\">Magnet sensor in the door frame<\/p><\/div>\n<ul>\n<li>The Arduino reads the state of the magnets and changes the colour of our set of HUE lights (<a title=\"How to control a set of HUE lights from a MIDI controller\" href=\"http:\/\/www.ustwo.co.uk\/blog\/midi-controller-to-philips-hue\/\">remember?<\/a>)<\/li>\n<\/ul>\n<p><div id=\"attachment_4998\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-4998\" title=\"Arduino + breadboard\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/07\/arduino.jpg\" alt=\"An Arduino “breadboard” with wires going into the slots\" width=\"555\" height=\"320\" \/><p class=\"wp-caption-text\">The Arduino wired up to the magnets in the door<\/p><\/div>\n<ul>\n<li>The Arduino also sends the state (engaged or vacant) of each door to a central server that offers that information as a REST API to ustwo™ developers<\/li>\n<li>Developers build clients around that API<\/li>\n<\/ul>\n<p>Take for example the OSX widget featured below. Once installed it queries the sensor API and displays the state of the toilets (and shower!) in this case of the 3 floors of the London studio. States are represented by either a running man (vacant) or a lock (engaged). API clients of course can take things a step further and in this widget you can select several toilets and get a notification once they are free.<\/p>\n<p><div id=\"attachment_4987\" style=\"width: 565px\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-4987\" title=\"ustwo's toilet indicators\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/07\/lights_short.gif\" alt=\"An animated gif with multiple states, showing that when the ladies loos are engaged, the pink light goes on and the desktop app shows a padlock icon next to “Girls” on screen. Likewise, when the gents are engaged, the blue light comes on and the padlock appears next to “Boys” on screen.\" width=\"555\" height=\"320\" \/><p class=\"wp-caption-text\">The engaged lights in action<\/p><\/div>\n<p>For the geekiest of the ustwobies that spend most of their time looking at a terminal window (me!), there is also of course a much simpler command line client:<\/p>\n<p><img class=\"alignnone size-full wp-image-5011\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/07\/toilets_terminal_client.png\" alt=\"\" width=\"394\" height=\"399\" \/><\/p>\n<p><strong>Ethics<\/strong><\/p>\n<p>The toilet indicators were an immediate success with user feedback requesting to go one step further. They wanted the ability to know if the previous occupant had done a #1 or #2—invaluable information as to whether the toilet was safe to visit or not. Our problem was no longer strictly technical, but ethical.<\/p>\n<p>The fact is most people wouldn’t be comfortable sharing in no uncertain terms that they had just unleashed the kraken, particularly since we share the toilets with our clients.<\/p>\n<p>So after some deliberation we decided not to implement the #1 vs #2 feature. Instead, some API clients have decided to implement a warning if the toilet has just become available after over five minutes of use. Therefore allowing people, after some quick due diligence\/ risk assessment, to decide what might be waiting for them behind that door&#8230;<\/p>\n<p><strong>What&#8217;s next<\/strong><\/p>\n<p>So far we have a (working) proof of concept and are only just beginning to understand the requirements of this kind of hardware within real life scenarios.<\/p>\n<p>There are of course a few things we’d like to improve or expand on including:<\/p>\n<ul>\n<li>Take the Arduino to a production level by building a custom shield so we can easily connect and disconnect the magnets (<a title=\"How to create a custom Arduino shield\" href=\"http:\/\/startingelectronics.com\/projects\/arduino-projects\/arduino-tiny-stripboard-shield\/\">tutorial<\/a>)<\/li>\n<li>Remote deployment of code updates to the Arduinos<\/li>\n<li>Non blocking WiFi connections (so in case the Arduino is disconnected the system is not affected until network is restored)<\/li>\n<li>A NodeJS API because who <em>doesn&#8217;t<\/em> need real time information about the state of the toilets?<\/li>\n<li>Add more sensors to collect data such as temperature, humidity but also tracking objects and individuals (totally opt-in!)<\/li>\n<\/ul>\n<p>At the end of the day we’re designers in the broadest sense of the word, we find solutions to problems. Once we master the skills required to interact and manipulate &#8220;the real world&#8221; we will be able to use our brains to solve problems that exist outside of a screen. The Internet of things is just a new set of tools that we are adding to our current tool set.<\/p>\n<p>Stay tuned.<\/p>\n","date":"2 August 2013","link":"http:\/\/ustwo.localhost\/blog\/digitally-engaged\/","category":"Development","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/07\/arduino.jpg","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[{"author":{"name":"rr","email":"ryan@aqworks.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Perhaps instead of #1 or #2, a \"user\" can simply volunteer that information when they know it's particularly... important. Via a wave at a sensor.\n\nWe've actually been looking to do the same thing for our office, as we only have 1 bathroom for quite a few boys and girls. Thanks for solving half of this for us!","date":"2013-12-06 06:33:00"},{"author":{"name":"Samuel Cox","email":"samuel.t.cox@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"Maybe explore moving away from the Arduino platform at 'production level'. It might be worth looking into BLE with the Ti CC2540 and programming its MCU and fit it onto a custom PCB. You'd be wireless, efficient and small!","date":"2013-09-04 11:57:00"},{"author":{"name":"Danielle","email":"japstyle@gmail.com","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' \/>"},"content":"\"Add more sensors to collect data such as temperature, humidity but also tracking objects and individuals (totally opt-in!)\"\n\nWhat like, if you leave your stapler in the toilet, or if the toilet roll goes missing?\nJoking aside, its interesting to see what's possible from a wired up home, with tools such as Arduino etc.","date":"2013-08-25 18:52:00"}],"count":3},"social":{"tweets":"20","facebook":"0","plus":"5","total":25},"layout":{"categoryClass":"development"},"extraClasses":""},{"id":4747,"title":"The World According to Gyppsy — The Industry of Ideas","excerpt":"\n\nWelcome to the first instalment of the World According to Gyppsy, a series of posts where ustwo™'s resident pixel geek gives you an insight into his world and what he's learned over the past ten years. The first topic up for discussion: The Industry of Ideas.","content":"<p>Welcome to the first installment of the world according to Gyppsy. As part of our Visual Designers Weekly (VDW) catch ups, we all get the opportunity to present a topic to the group here at ustwo™. For one of my recent sessions, I decided to give the other designers a window into my world, by sharing what I’ve learned about myself and the industry over the last ten years. It was part <a title=\"Pecha Kucha\" href=\"http:\/\/en.wikipedia.org\/wiki\/PechaKucha\">Pecha Kucha<\/a>, part pep talk and part rant.<\/p>\n<p><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-world-according-to-gyppsy-the-industry-of-ideas\/title\/\" rel=\"attachment wp-att-4751\"><img title=\"Title\" alt=\"The World According to Gyppsy — The Industry of Ideas\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/06\/Title.png\" width=\"555\" height=\"320\" \/><\/a><\/p>\n<p>Rather than let the presentation sit on Dropbox gathering virtual dust, I thought I’d spin off some of what I mentioned into a series of blog posts. The first thing I’d like to cover is one of my little rants: The Industry of Ideas.<\/p>\n<p>Few of us will have failed to notice the rise of startup culture over recent years, and with it a new bunch of buzzwords that appear in every related shallow-depth-of-field video that gets released: “disrupt”, “fail”, “iterate”, “lean” etc.<\/p>\n<p>Personally it’s the use of the two “i”s that’s beginning to grate on me: ideas and inspiration. Let me explain…<\/p>\n<h3>What&#8217;s My Beef?<\/h3>\n<p>The media have understandably been keen to publicise startup success stories, with a constant stream of talking heads often giving the impression that all you need is an idea, plenty of hard work and an obligatory pivot or two before you become the next twenty-something billionaire.<\/p>\n<p>With this however comes a certain degree of pressure &#8211; as it can seem like everyone is doing it, so why aren’t you? For those looking for their own success, the hard work part is obvious enough, but how do you get that killer idea in the first place? Off the back of that question have come a multitude of videos \/ podcasts \/ conferences \/ books, all giving the impression that they’ll inspire you to do great things, to have that one idea. But does this content really help or is just playing on people’s dreams and desires?<\/p>\n<p>My first query is the concept that ideas and inspiration can be packaged up and delivered in a conveniently bite sized video or blog post, and that by spending fifteen minutes of your time listening or reading them — a spark can be ignited.<\/p>\n<p>For me, it doesn’t seem to work like this and that’s not to dismiss this type of content completely, as a lot of it has some great value and insight. I think however, somewhere along the lines, the words ‘inspirational’ and ‘interesting’ have got muddled up. I’ll often come away from watching a talk and think, “that was quite cool, didn’t realise that”, but then I’ll just carry on with business as usual. How many of us can truly say that something we’ve seen has really given us a jolt, made us get up and actually do something, or completely changed our lives?<\/p>\n<p><div id=\"attachment_4748\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-world-according-to-gyppsy-the-industry-of-ideas\/inspiration-procrastination\/\" rel=\"attachment wp-att-4748\"><img class=\"size-full wp-image-4748\" title=\"Inspiration = Procrastination\" alt=\"Inspiration = Procrastination\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/06\/Inspiration-Procrastination.png\" width=\"555\" height=\"396\" \/><\/a><p class=\"wp-caption-text\">Inspiration = Procrastination<\/p><\/div>\n<p>To some extent you could argue that searching for inspiration is a form of procrastination. We’re all guilty of sitting down to watch a TED talk, perceiving this as a more valuable use of our time and ultimately hoping this process is the catalyst for the much needed motivation we’re looking for.<\/p>\n<p>But I struggle personally with the notion of relying on an external source to give me that drive; instead I’m a firm believer in <a title=\"JFDI blog post\" href=\"http:\/\/www.ustwo.co.uk\/blog\/jfdi-so-many-words-so-little-time\/\">JFDI<\/a>.<\/p>\n<p>Another concern is that overall it feels like we’re reaching complete and utter saturation. If you were to watch every video, read every book, and attend every talk, then the reality is there’d be no time left to do anything else!<\/p>\n<h3>Where do my ideas and inspiration come from?<\/h3>\n<p>It goes without saying that during the process of writing this post, I inevitably had to ask myself where my ideas and inspiration come from, and although I can’t give any definitive answers, I think I understand what makes a good breeding ground for them.<\/p>\n<p><div id=\"attachment_4750\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-world-according-to-gyppsy-the-industry-of-ideas\/the-jfdi-conference\/\" rel=\"attachment wp-att-4750\"><img class=\"size-full wp-image-4750\" title=\"The JFDI Conference\" alt=\"The JFDI Conference\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/06\/The-JFDI-Conference.png\" width=\"555\" height=\"555\" \/><\/a><p class=\"wp-caption-text\">The JFDI Conference — open to everyone<\/p><\/div>\n<p>First of all: hard work. Success isn’t built overnight, but neither are ideas. Having read <a title=\"Outliers\" href=\"http:\/\/www.amazon.co.uk\/Outliers-Story-Success-Malcolm-Gladwell\/dp\/0141036257\/ref=sr_1_1?ie=UTF8&amp;qid=1372193843&amp;sr=8-1&amp;keywords=outliers\">Outliers by Malcolm Gladwell<\/a> a few years ago (whilst on holiday may I add, so technically I wasn’t procrastinating) I’m now starting to see the logic in his 10,000 hours theory (at the time I was probably only up to 7–8,000). Do something repetitively, get good at it and that way you’ll see areas for improvement and how you can refine or revolutionise them.<\/p>\n<p>When that time comes, you’ll have the knowledge and experience to realise what you’re on to, and most importantly make the most of it. I’ve been able to draw parallels with this thinking from my own career, and having worked for years learning the art of pixel perfect design, I realised that there was no real guidance out there to help young aspiring designers on these specific details. From that need, the <a title=\"The ustwo™ Pixel Perfect Precision Handbook 2\" href=\"http:\/\/www.ustwo.co.uk\/blog\/the-ustwo-pixel-perfect-precision-handbook-2\/\">Pixel Perfect Precision Handbook<\/a> came in to being, something that wouldn’t have been possible without the years of experience beforehand.<\/p>\n<p>Secondly: variety. Take an interest in topics and activities outside your field as this gives you a broader range of references and knowledge. Steve Jobs sums it up beautifully for me:<\/p>\n<blockquote><p>“Creativity is just connecting things. When you ask creative people how they did something, they feel a little guilty because they didn’t really do it, they just saw something. It seemed obvious to them after a while. That’s because they were able to connect experiences they’ve had and synthesize new things. And the reason they were able to do that was that they’ve had more experiences or they have thought more about their experiences than other people.”<\/p>\n<\/blockquote>\n<p><div id=\"attachment_4749\" style=\"width: 565px\" class=\"wp-caption alignnone\"><a href=\"http:\/\/www.ustwo.co.uk\/blog\/the-world-according-to-gyppsy-the-industry-of-ideas\/the-idea-factory\/\" rel=\"attachment wp-att-4749\"><img class=\"size-full wp-image-4749\" title=\"The Idea Factory\" alt=\"Idea Factory\" src=\"http:\/\/www.ustwo.co.uk\/wordpress\/wp-content\/uploads\/2013\/06\/The-Idea-Factory.png\" width=\"555\" height=\"418\" \/><\/a><p class=\"wp-caption-text\">A ready-made idea factory<\/p><\/div>\n<p>Lastly: put the bloody phone down… Stop being over-stimulated and do something boring. It’s great to chuck all this knowledge and experience into your head, but like a good beer, it all needs time to ferment. The classic location for a brainwave for me is in the shower, as there’s no external distraction your mind has time to wander and think about random things. If you’re lucky those things may connect. In my case, I’ve had some great i<br \/>\ndeas whilst doing the washing up, or mowing the lawn (pixel perfect edges of course). So next time you’re waiting for the bus, rather than pull out your phone and jump onto Facebook or Twitter, spend a little time daydreaming. Trust me, it works.<\/p>\n<h3>Final Thoughts<\/h3>\n<p>The problem with pontificating about anything like this is that it’s so speculative because we’re all so different, that it’s impossible to come up with some one-size-fits-all solution in terms of advice. For some, indulging in the world of inspiration may well produce some amazing ideas, but I wanted to provide a counterpoint for people such as myself who don’t work like that, and to that extent I hope this has been of some help.<\/p>\n","date":"25 July 2013","link":"http:\/\/ustwo.localhost\/blog\/the-world-according-to-gyppsy-the-industry-of-ideas\/","category":"Culture","thumbnail":"http:\/\/ustwo.localhost\/wp-content\/uploads\/2013\/06\/The-JFDI-Conference.png","author":{"name":"ustwo","avatar":"<img alt='' src='http:\/\/0.gravatar.com\/avatar\/6377f240550c05695407ee97ddad9a62?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=G' class='avatar avatar-110 photo' height='110' width='110' \/>","description":""},"comments":{"items":[],"count":0},"social":{"tweets":"18","facebook":"11","plus":"5","total":34},"layout":{"categoryClass":"culture"},"extraClasses":""}],"number":"55"},"searchString":false}